app/Controllers/DashboardController.php

    public function index()
    {
        // Inisialisasi model
        $categoryModel = new CategoryModel();
        $costumeModel = new CostumeModel();
        $carouselImages = [
            ['src' => 'carousel-1.jpg', 'alt' => 'Sewa Kostum Berkualitas'],
            ['src' => 'carousel-2.jpg', 'alt' => 'Berbagai Macam Pilihan'],
            ['src' => 'carousel-3.jpg', 'alt' => 'Harga Terjangkau'],
        ];

        // Ambil data dari database
        $data = [
            'title'      => 'Selamat Datang di My Costume',
            'carouselImages' => $carouselImages,
            'categories' => $categoryModel->findAll(),
            'costumes'   => $costumeModel->findAll(8) // Ambil 8 kostum terbaru/rekomendasi
---
SELECT *
FROM `categories`
SELECT *
FROM `costumes`
 LIMIT 8