app/Controllers/ProductController.php

    public function detail($id)
    {
        // Inisialisasi model
        $costumeModel = new CostumeModel();
        // $costumeImageModel = new CostumeImageModel(); // Pastikan baris ini dihapus
        $costumeSizeModel = new CostumeSizeModel();
        $costumePricingModel = new CostumePricingModel();
        $reviewModel = new ReviewModel();

        // Ambil data utama kostum & join dengan kategori untuk mendapatkan nama kategori
        $costume = $costumeModel
            ->select('costumes.*, categories.name as category_name')
            ->join('categories', 'categories.id = costumes.category_id')
            ->where('costumes.id', $id)
            ->first();

        // Jika kostum tidak ditemukan, tampilkan halaman 404
        if (!$costume) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Ambil data pendukung
        $sizes = $costumeSizeModel->where('costume_id', $id)->findAll();
        $pricing = $costumePricingModel->where('costume_id', $id)->findAll();

        // Ambil ulasan & join dengan user untuk mendapatkan nama user
        $reviews = $reviewModel
            ->select('reviews.*, users.nama as user_name')
            ->join('users', 'users.id = reviews.user_id')
            ->where('costume_id', $id)
            ->findAll();
---
SELECT `costumes`.*, `categories`.`name` as `category_name`
FROM `costumes`
JOIN `categories` ON `categories`.`id` = `costumes`.`category_id`
WHERE `costumes`.`id` = '6'
 LIMIT 1
SELECT *
FROM `costume_sizes`
WHERE `costume_id` = '6'
SELECT *
FROM `costume_pricing`
WHERE `costume_id` = '6'
SELECT `reviews`.*, `users`.`nama` as `user_name`
FROM `reviews`
JOIN `users` ON `users`.`id` = `reviews`.`user_id`
WHERE `costume_id` = '6'