app/Controllers/SearchController.php

    public function index()
    {
        // Ambil kata kunci dari URL (?keyword=...)
        $keyword = $this->request->getGet('keyword');

        $costumeModel = new CostumeModel();
        $costumes = [];

        // Hanya lakukan pencarian jika ada kata kunci
        if ($keyword && trim($keyword) !== '') {
            $costumes = $costumeModel
                ->like('name', $keyword)
                ->orLike('description', $keyword)
                ->findAll();
---
SELECT *
FROM `costumes`
WHERE `name` LIKE '%ge%' ESCAPE '!'
OR  `description` LIKE '%ge%' ESCAPE '!'